-- phpMyAdmin SQL Dump
-- version 4.8.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Jul 07, 2018 at 08:09 PM
-- Server version: 5.7.22
-- PHP Version: 7.1.16

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `jlpt`
--

-- --------------------------------------------------------

--
-- Table structure for table `word_201807`
--

CREATE TABLE `word_201807` (
  `id` int(10) NOT NULL,
  `word` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `reading` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `meaning` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `example` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `word_201807`
--

INSERT INTO `word_201807` (`id`, `word`, `reading`, `meaning`, `example`, `created_at`, `updated_at`) VALUES
(1, '世代', 'せいだい', 'thế hệ', 'この歌は、世代を超えて誰からも愛されている', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(2, '予想', 'よそう', 'dự đoán', '人々の予想に反して、そのチームは試合に負けてしまった。', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(3, '把握', 'はあく', 'nắm rõ, hiểu rõ', '事故防止は、事故の原因を把握することから始まる。', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(4, '部下', 'ぶか', 'cấp dưới', '部下から結婚のスピーチを頼まれた', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(5, '市場', 'しじょう', 'thị trường', '金融市場は、世界経済の影響を強く受ける', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(6, '投票', 'とうひょう', 'bỏ phiếu', '選挙の時には、できれば投票に行きましょう', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(7, '察する', 'さっする', 'hiểu, thông cảm', '母が亡くなったので、私の気持ちを察してください。', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(8, '在籍', 'ざいせき', 'đang theo học', '佐藤さんは文学部に在籍し、現代小説を研究している', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(9, '数値', 'すうち', 'chỉ số', '景気を探るには、お金の動きを示す数値が目安になる', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(10, '配置', 'はいち', 'bài trí', '掃除のついでに、家具の配置を変えました。', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(11, '拡大', 'かくだい', 'tăng trưởng', '人気の商品を飛ぶように売れて、会社の利益も拡大した', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(12, '発生', 'はっせい', 'phát sinh', 'その事件が発生したのは、昨日の深夜だった。', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(13, '仕組み', 'しくみ', 'cấu tạo', '時計の仕組みは複雑で多くの部品が必要だ', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(14, '事態', 'じたい', 'tình hình', 'こんな困った事態になろうとは、夢にも思わなかった', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(15, '達成', 'たっせい', 'đạt được', 'みんなで頑張ったおかげで、今月の売り上げ目標を達成することができた', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(16, '業績', 'ぎょうせき', 'thành tích', 'わが社が今年、新製品がよく売れて業績が上がった', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(17, 'きちっと（する）', 'きちっと', 'ngăn nắp', '毎朝、家事をきちっとしてから会社に行く', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(18, '層', 'そう', 'tầng', '水と油は混ぜようとしても、二つの層に分かれる', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(19, '過程', 'かてい', 'quá trình', '自動車を作る過程で多くの電気が使われている', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(20, '応募（する）', 'おうぼ', 'ứng tuyển', '先生に勧められて、読書感想文のコンクールに応募した', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(21, '規制（する）', 'きせい', 'hạn chế', '外国製品の輸入には、様々な規制がかけられている', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(22, 'とっさに', 'さっさに', 'ngay lập tức', '小さい子供が転んだので、とっさに助けに走った', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(23, '指摘', 'してき', 'chỉ ra', '会社の経営に関するいろいろな問題が指摘された', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(24, '活性', 'かっせい', 'sống động, hiệu quả', '地域を活性化する', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(25, '事業', 'じぎょう', 'business', '彼はビジネスで成功したら、次に社会事業に関心を持った', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(26, '削減', 'さくげん', 'cắt giảm', '予算が削減されても、大学の教育の質は落とせない', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(27, '未熟', 'みじゅく', 'amateur', '彼の技術はまだ未熟なので、こんな難しい仕事は無理だ', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(28, '生かす', 'いかす', 'phát huy', '経験が生かせる', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(29, '積む', 'つむ', 'tích luỹ', '経験を積む', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(30, '分担', 'ぶんたん', 'phân công công việc', '仕事・タスク・役割を分担する', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(31, '嗜好品', 'しこうひん', 'hàng cao cấp', NULL, '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(32, '庶民', 'しょみん', 'dân thường', 'かつて自動車は庶民の手に届かない高価なものであった', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(33, '候補', 'こうほ', 'ứng cử', '責任者の候補', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(34, '規模', 'きぼ', 'quy mô', '会社の規模', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(35, '沸騰（する）', 'ふっとう', 'sôi', '水を沸騰する', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(36, '推移', 'すいい', 'thay đổi', '経済の推移', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(37, '参照', 'さんしょう', 'tham khảo', '事件例を参照する', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(38, '騒音', 'そうおん', 'tiếng ồn', '賑やかな町には、車や工場の音など様々な騒音が入り混じっている', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(39, '充実', 'じゅうじつ', 'phong phú', '充実な仕事', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(40, '抑える', 'おさえる', 'kiểm soát', '敵をおさえる', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(41, '睨む', 'にらむ', 'lườm', 'ホアちゃんを睨む', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(42, 'そらす', 'そらす', 'lảng tránh', '私が真剣に尋ねたのに、先生は話をそらした', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(43, '口論', 'こうろん', 'cãi nhau', '元彼女と口論して泣きてしまった', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(44, '破壊', 'はかい', 'phá huỷ', '環境破壊', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(45, 'いやに', 'いやに', 'kinh khủng', '非常に', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(46, '是正', 'ぜせい', 'chỉnh sửa', '現実に合わない法律の是正を求めている', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(47, '倒産', 'とうさん', 'phá sản', '会社を倒産する', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(48, '隠す', 'かくす', 'che giấu', '食べ物を隠す', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(49, '挙げる', 'あげる', 'giơ', '例を挙げる', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(50, '返済', 'へんさい', 'trả nợ', 'やっと家のローンの返済が終わった', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(51, '統治（する）', 'とうち', 'thống trị', 'この地方を統治する', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(52, 'ふさがる', 'ふさがる', 'bận rộn/tắc động', '今日はちょっとふさがっているから、他の日あいましょう', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(53, 'おごる', 'おごる', 'chiêu đãi', '今日おごるよ！', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(54, '進化', 'しんか', 'tiến hoá', '人類の進化の過程', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(55, '出生', 'しゅっしょう', 'sinh đẻ', 'ホアちゃんがいつ出生するの？', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(56, '取り引き（する）', 'とりひき', 'giao dịch', '日本の企業も、海外と取引する機会が増えてきた', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(57, '購入（する）', 'こうにゅう', 'mua sắm', NULL, '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(58, '交付（する）', 'こうふ', 'quyên góp', '交付金', '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(59, '一括', 'いっかつ', 'một lần', NULL, '2018-07-07 19:07:41', '2018-07-07 19:07:41'),
(60, '成果', 'せいか', 'thành quả', '成果を収める', '2018-07-07 19:07:41', '2018-07-07 19:07:41');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `word_201807`
--
ALTER TABLE `word_201807`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `idx_word201807` (`word`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `word_201807`
--
ALTER TABLE `word_201807`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
